lab11/nrf52x-base/sdk/nrf5_sdk_16.0.0_thread/components/benchmark/zigbee/zigbee_benchmark.c
/**
 * Copyright (c) 2018 - 2020, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

#include "benchmark_api.h"
#include "benchmark_zigbee_common.h"
#include "cpu_utilization.h"
#include "zboss_api.h"
#include "zigbee_cli.h"
#include "zigbee_cli_ping.h"
#include "app_timer.h"
#include "nrf_log.h"

typedef union
{
    zb_ieee_addr_t arr_addr;
    uint64_t       uint_addr;
} eui64_map_addr_t;

APP_TIMER_DEF(m_discovery_timer);
static zb_time_t                     m_start_time;
static benchmark_evt_t               m_benchmark_evt;
static benchmark_result_t            m_local_result;
static benchmark_result_t            m_remote_result;
static benchmark_callback_t          mp_callback;
static benchmark_peer_db_t           m_peer_information;
static benchmark_address_context_t   m_peer_addresses[BENCHMARK_MAX_PEER_NUMBER];
static benchmark_configuration_t   * mp_test_configuration;
static benchmark_test_state_t        m_state = TEST_IDLE;

static benchmark_status_t m_test_status =
{
    .test_in_progress   = false,
    .reset_counters     = false,
    .waiting_for_ack    = 0,
    .packets_left_count = 0,
    .acks_lost          = 0,
    .frame_number       = 0,
    .latency            =
    {
        .min = UINT32_MAX,
        .max = UINT32_MAX
    },
};

/**@brief Function that triggers calculation of the test duration. */
static void benchmark_test_duration_calculate(void)
{
    m_local_result.duration = ZB_TIME_BEACON_INTERVAL_TO_MSEC(ZB_TIMER_GET() - m_start_time);
}

/**@brief Function that reads current MAC-level statistics from the radio.
  *
  * @param[out] p_mac_tx_counters  Pointer to the structure holding MAC-level TX statistics.
  *
  * @note Returned values are reset to zero only after system reboot.
  */
static void mac_counters_read(benchmark_mac_counters_t * p_mac_tx_counters)
{
    zb_nrf52_radio_stats_t * p_stats = zb_nrf52_get_radio_stats();

    NRF_LOG_DEBUG("Radio RX statistics:");
    NRF_LOG_DEBUG("\trx_successful: %ld", p_stats->rx_successful);
    NRF_LOG_DEBUG("\trx_err_none: %ld", p_stats->rx_err_none);
    NRF_LOG_DEBUG("\trx_err_invalid_frame: %ld", p_stats->rx_err_invalid_frame);
    NRF_LOG_DEBUG("\trx_err_invalid_fcs: %ld", p_stats->rx_err_invalid_fcs);
    NRF_LOG_DEBUG("\trx_err_invalid_dest_addr: %ld", p_stats->rx_err_invalid_dest_addr);
    NRF_LOG_DEBUG("\trx_err_runtime: %ld", p_stats->rx_err_runtime);
    NRF_LOG_DEBUG("\trx_err_timeslot_ended: %ld", p_stats->rx_err_timeslot_ended);
    NRF_LOG_DEBUG("\trx_err_aborted: %ld\r\n", p_stats->rx_err_aborted);

    NRF_LOG_DEBUG("Radio TX statistics:");
    NRF_LOG_DEBUG("\ttx_successful: %d", p_stats->tx_successful);
    NRF_LOG_DEBUG("\ttx_err_none: %d", p_stats->tx_err_none);
    NRF_LOG_DEBUG("\ttx_err_busy_channel: %d", p_stats->tx_err_busy_channel);
    NRF_LOG_DEBUG("\ttx_err_invalid_ack: %d", p_stats->tx_err_invalid_ack);
    NRF_LOG_DEBUG("\ttx_err_no_mem: %d", p_stats->tx_err_no_mem);
    NRF_LOG_DEBUG("\ttx_err_timeslot_ended: %d", p_stats->tx_err_timeslot_ended);
    NRF_LOG_DEBUG("\ttx_err_no_ack: %d", p_stats->tx_err_no_ack);
    NRF_LOG_DEBUG("\ttx_err_aborted: %d", p_stats->tx_err_aborted);
    NRF_LOG_DEBUG("\ttx_err_timeslot_denied: %d", p_stats->tx_err_timeslot_denied);

    p_mac_tx_counters->error = p_stats->tx_err_busy_channel + p_stats->tx_err_no_mem
                               + p_stats->tx_err_invalid_ack + p_stats->tx_err_no_ack
                               + p_stats->tx_err_aborted + p_stats->tx_err_timeslot_ended + p_stats->tx_err_timeslot_denied;
    p_mac_tx_counters->total = p_stats->tx_successful + p_mac_tx_counters->error;
}

/**@brief Function that clears the radio MAC-level TX statistics. */
static void mac_counters_clear(void)
{
    mac_counters_read(&m_local_result.mac_tx_counters);
}

/**@brief Function that triggers calculation of the radio MAC-level TX statistics. */
static void mac_counters_calculate(void)
{
    benchmark_mac_counters_t current_mac_tx_counters;

