lab11/nrf52x-base/sdk/nrf5_sdk_16.0.0_thread/components/benchmark/zigbee/zigbee_benchmark.c
    // Read current radio TX statistics.
    mac_counters_read(&current_mac_tx_counters);

    // Subtract from statistics from the beginning of the test.
    m_local_result.mac_tx_counters.total = current_mac_tx_counters.total - m_local_result.mac_tx_counters.total;
    m_local_result.mac_tx_counters.error = current_mac_tx_counters.error - m_local_result.mac_tx_counters.error;
}

/**@brief Function that resets all test counters. */
static void result_clear(void)
{
    memset(&m_local_result, 0, sizeof(m_local_result));
    memset(&m_remote_result, 0, sizeof(m_remote_result));
    cpu_utilization_clear();
    benchmark_clear_latency(&m_test_status.latency);
    mac_counters_clear();

    m_local_result.rx_counters.rx_total = BENCHMARK_COUNTERS_VALUE_NOT_SUPPORTED;
    m_local_result.rx_counters.rx_error = BENCHMARK_COUNTERS_VALUE_NOT_SUPPORTED;
}

/**@brief Callback for discovery timeout event.
 *
 * @param[in] p_context Unused parameter.
 */
static void discovery_timeout(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    m_benchmark_evt.evt                        = BENCHMARK_DISCOVERY_COMPLETED;
    m_benchmark_evt.context.p_peer_information = &m_peer_information;

    if (mp_callback)
    {
        mp_callback(&m_benchmark_evt);
    }
}

/**@brief A callback called on EUI64 address response.
 *
 * @param[in] bufid Reference number to ZBOSS memory buffer.
 */
static void zb_resolve_ieee_addr_cb(zb_bufid_t bufid)
{
    zb_zdo_ieee_addr_resp_t * p_resp = (zb_zdo_ieee_addr_resp_t *)zb_buf_begin(bufid);

    if (p_resp->status == ZB_ZDP_STATUS_SUCCESS)
    {
        zb_address_ieee_ref_t addr_ref;
        eui64_map_addr_t      ieee_addr;
        zb_uint16_t           nwk_addr;
        uint_fast8_t          i;

        ZB_LETOH64(ieee_addr.arr_addr, p_resp->ieee_addr_remote_dev);
        ZB_LETOH16(&nwk_addr, &(p_resp->nwk_addr_remote_dev));
        UNUSED_RETURN_VALUE(zb_address_update(ieee_addr.arr_addr, nwk_addr, ZB_TRUE, &addr_ref));
        NRF_LOG_DEBUG("Received EUI64 address for device 0x%04x -> %ld.", nwk_addr, ieee_addr.uint_addr);

        for (i = 0; i < m_peer_information.peer_count; i++)
        {
            if (m_peer_information.peer_table[i].p_address->nwk_addr == nwk_addr)
            {
                m_peer_information.peer_table[i].device_id = ieee_addr.uint_addr;
                NRF_LOG_DEBUG("The device with address 0x%04x is updated.", nwk_addr);
                break;
            }
        }
    }
    else
    {
        NRF_LOG_WARNING("Unable to resolve EUI64 source address. Status: %d\r\n",
                        p_resp->status);
    }

    zb_buf_free(bufid);
}

/**@brief Resolve EUI64 by sending IEEE address request.
 *
 * @param[in] bufid     Reference number to ZBOSS memory buffer.
 * @param[in] nwk_addr  Network address to be resolved.
 */
static void zb_resolve_ieee_addr(zb_bufid_t bufid, zb_uint16_t nwk_addr)
{
    zb_zdo_ieee_addr_req_param_t * p_req = NULL;
    zb_uint8_t                     tsn = 0;

    // Create new IEEE address request and fill with default values.
    p_req = ZB_BUF_GET_PARAM(bufid, zb_zdo_ieee_addr_req_param_t);
    p_req->start_index  = 0;
    p_req->request_type = 0;
    p_req->nwk_addr     = nwk_addr;
    p_req->dst_addr     = p_req->nwk_addr;

    tsn = zb_zdo_ieee_addr_req(bufid, zb_resolve_ieee_addr_cb);
    if (tsn == ZB_ZDO_INVALID_TSN)
    {
        NRF_LOG_WARNING("Failed to send IEEE address request for address: 0x%04x", nwk_addr);
        zb_buf_free(bufid);
    }
}

/**@brief A callback called on match descriptor response.
 *
 * @param[in] bufid a reference number to ZBOSS memory buffer
 */
static void zb_find_peers_cb(zb_bufid_t bufid)
{
    zb_zdo_match_desc_resp_t   * p_resp = (zb_zdo_match_desc_resp_t *)zb_buf_begin(bufid);
    zb_apsde_data_indication_t * p_ind  = ZB_BUF_GET_PARAM(bufid, zb_apsde_data_indication_t);

    if (p_resp->status == ZB_ZDP_STATUS_SUCCESS)
    {
        zb_uint8_t * p_match_ep = (zb_uint8_t *)(p_resp + 1);
        zb_uint8_t   match_len  = p_resp->match_len;

        while (match_len > 0)
        {
            /* Match EP list follows right after response header */
            if (*p_match_ep == zb_get_cli_endpoint())
            {
                uint16_t peer_number = m_peer_information.peer_count;

                NRF_LOG_INFO("Peer found: %0hx", p_ind->src_addr);

                if (peer_number < BENCHMARK_MAX_PEER_NUMBER)
                {
                    m_peer_information.peer_table[peer_number].device_id = 0;
                    m_peer_information.peer_table[peer_number].p_address = &m_peer_addresses[peer_number];
                    m_peer_information.peer_table[peer_number].p_address->nwk_addr = p_ind->src_addr;
                    m_peer_information.peer_count++;

                    // Try to resolve EUI64 address based on NWK address (best effort).
                    zb_resolve_ieee_addr(bufid, p_ind->src_addr);
                    bufid = 0;
                }
                else
                {
                    NRF_LOG_INFO("Can't add peer to the list, list full.");
                }
            }

            p_match_ep += 1;
            match_len -= 1;
        }
    }

    if (bufid)
    {
        zb_buf_free(bufid);
    }
}

/**@brief Function that constructs and sends discovery request. */
static zb_ret_t zigbee_benchmark_peer_discovery_request_send(void)
{
    zb_zdo_match_desc_param_t * p_req;
    zb_bufid_t                  bufid;

    bufid = zb_buf_get_out();
    if (!bufid)
    {
        NRF_LOG_ERROR("Failed to execute command (buffer allocation failed).");
        return RET_ERROR;
    }

    /* Initialize pointers inside buffer and reserve space for zb_zdo_match_desc_param_t request */
    p_req = zb_buf_initial_alloc(bufid, sizeof(zb_zdo_match_desc_param_t));

    p_req->nwk_addr         = ZB_NWK_BROADCAST_RX_ON_WHEN_IDLE; // Send to all non-sleepy devices
    p_req->addr_of_interest = ZB_NWK_BROADCAST_RX_ON_WHEN_IDLE; // Get responses from all non-sleepy devices
    p_req->profile_id       = ZB_AF_HA_PROFILE_ID;              // Look for Home Automation profile clusters

    /* We are searching for 1 input cluster: Basic */
    p_req->num_in_clusters  = 1;
    p_req->num_out_clusters = 0;
    p_req->cluster_list[0]  = ZB_ZCL_CLUSTER_ID_BASIC;

