lab11/nrf52x-base/sdk/nrf5_sdk_16.0.0_thread/components/benchmark/zigbee/zigbee_benchmark.c
    uint8_t tsn = zb_zdo_match_desc_req(bufid, zb_find_peers_cb);
    if (tsn == ZB_ZDO_INVALID_TSN)
    {
        zb_buf_free(bufid);
        return RET_ERROR;
    }

    return RET_OK;
}

/**@brief  Ping event handler. Updates RX counters and changes state to send next request.
 *
 * @param[in] evt_type  Type of received  ping acknowledgment
 * @param[in] delay_us  Time, in microseconds, between ping request and the event.
 * @param[in] p_request Pointer to the ongoing ping request context structure.
 */
static void benchmark_ping_evt_handler(ping_time_evt_t evt, zb_uint32_t delay_us, ping_request_t * p_request)
{
    switch (evt)
    {
        case PING_EVT_FRAME_SENT:
            if (m_state == TEST_IN_PROGRESS_FRAME_SENDING)
            {
                m_state = TEST_IN_PROGRESS_FRAME_SENT;
            }
            break;

        case PING_EVT_ACK_RECEIVED:
            if (m_state == TEST_IN_PROGRESS_FRAME_SENT_WAITING_FOR_ACK)
            {
                m_test_status.waiting_for_ack = 0;
                m_state = TEST_IN_PROGRESS_FRAME_SENT;
                benchmark_update_latency(&m_test_status.latency, delay_us / 2);
                NRF_LOG_DEBUG("Transmission time: %u us", delay_us / 2);
            }
            break;

        case PING_EVT_ECHO_RECEIVED:
            if (m_state == TEST_IN_PROGRESS_FRAME_SENT_WAITING_FOR_ECHO)
            {
                m_test_status.waiting_for_ack = 0;
                m_state = TEST_IN_PROGRESS_FRAME_SENT;
                benchmark_update_latency(&m_test_status.latency, delay_us / 2);
                NRF_LOG_DEBUG("Transmission time: %u us", delay_us / 2);
            }
            break;

        case PING_EVT_FRAME_TIMEOUT:
            if ((m_state == TEST_IN_PROGRESS_FRAME_SENT_WAITING_FOR_ACK) ||
                (m_state == TEST_IN_PROGRESS_FRAME_SENT_WAITING_FOR_ECHO))
            {
                m_test_status.waiting_for_ack = 0;
                m_test_status.acks_lost++;
                m_state = TEST_IN_PROGRESS_FRAME_SENT;
                NRF_LOG_DEBUG("Transmission timed out.");
            }
            break;

        case PING_EVT_FRAME_SCHEDULED:
            if (m_test_status.packets_left_count)
            {
                m_test_status.packets_left_count--;
            }

            if (m_state == TEST_IN_PROGRESS_FRAME_SENDING)
            {
                if (mp_test_configuration)
                {
                    if (mp_test_configuration->mode != BENCHMARK_MODE_UNIDIRECTIONAL)
                    {
                        m_state = TEST_IN_PROGRESS_FRAME_SENT;
                    }
                }
                else
                {
                    m_state = TEST_IN_PROGRESS_FRAME_SENT;
                }
            }
            else
            {
                m_test_status.waiting_for_ack = p_request->ping_seq;
                m_test_status.frame_number    = p_request->ping_seq;
            }
            break;

        case PING_EVT_ERROR:
            if ((m_state == TEST_IN_PROGRESS_FRAME_SENT_WAITING_FOR_ACK) ||
                (m_state == TEST_IN_PROGRESS_FRAME_SENT_WAITING_FOR_ECHO) ||
                (m_state == TEST_IN_PROGRESS_FRAME_SENDING))
            {
                m_state = TEST_IN_PROGRESS_WAITING_FOR_TX_BUFFER;
            }
            break;

        case PING_EVT_REQUEST_RECEIVED:
            if (m_test_status.reset_counters)
            {
                // First packet in slave mode received.
                cpu_utilization_clear();
                // Reset MAC-level TX counters in order to ignore initial control message response.
                mac_counters_clear();
                m_test_status.reset_counters = false;
            }

            m_local_result.rx_counters.bytes_received += p_request->count;
            m_local_result.rx_counters.packets_received ++;

            break;
        default:
            break;
    }
}

/**@brief Function that constructs and sends ping request. */
static void zigbee_benchmark_send_ping_req(nrf_cli_t * p_cli)
{
    ping_request_t * p_ping_req;

    if (m_test_status.packets_left_count == 0)
    {
        return;
    }

    if (m_state != TEST_IN_PROGRESS_WAITING_FOR_TX_BUFFER)
    {
        return;
    }

    p_ping_req = zb_ping_acquire_request();
    if (p_ping_req == NULL)
    {
        return;
    }

    if (mp_test_configuration->length > PING_MAX_LENGTH)
    {
        m_state = TEST_ERROR;
        zb_ping_release_request(p_ping_req);
        return;
    }

    p_ping_req->remote_addr.addr_short = m_peer_information.peer_table[m_peer_information.selected_peer].p_address->nwk_addr;
    p_ping_req->remote_addr_mode = ZB_APS_ADDR_MODE_16_ENDP_PRESENT;
    p_ping_req->timeout_ms = mp_test_configuration->ack_timeout;
    p_ping_req->count = mp_test_configuration->length;
    p_ping_req->p_cli = p_cli;
    p_ping_req->p_cb = benchmark_ping_evt_handler;

    switch (mp_test_configuration->mode)
    {
        case BENCHMARK_MODE_UNIDIRECTIONAL:
            p_ping_req->request_ack  = 0;
            p_ping_req->request_echo = 0;
            m_state = TEST_IN_PROGRESS_FRAME_SENDING;
            break;

        case BENCHMARK_MODE_ECHO:
            p_ping_req->request_ack  = 0;
            p_ping_req->request_echo = 1;
            m_state = TEST_IN_PROGRESS_FRAME_SENT_WAITING_FOR_ECHO;
            break;

        case BENCHMARK_MODE_ACK:
            p_ping_req->request_ack  = 1;
            p_ping_req->request_echo = 0;
            m_state = TEST_IN_PROGRESS_FRAME_SENT_WAITING_FOR_ACK;
            break;

        default:
            NRF_LOG_ERROR("Unsupported test mode - fall back to the default mode.");
            mp_test_configuration->mode = BENCHMARK_MODE_ECHO;
            p_ping_req->request_ack     = 0;
            p_ping_req->request_echo    = 1;
            m_state = TEST_IN_PROGRESS_FRAME_SENT_WAITING_FOR_ECHO;
            break;
    }

    ping_request_send(p_ping_req);
}

