lab11/nrf52x-base/sdk/nrf5_sdk_16.0.0_thread/components/benchmark/zigbee/zigbee_benchmark.c
/**@brief Function that starts benchmark test in master mode. */
static void zigbee_benchmark_test_start_master(void)
{
    if (m_state != TEST_IDLE)
    {
        NRF_LOG_ERROR("Stop current test in order to start different suite.");
        return;
    }

    result_clear();
    // Ignore APS ACK transmission for the TEST_START_REQUEST command.
    m_local_result.mac_tx_counters.total++;

    UNUSED_RETURN_VALUE(cpu_utilization_start());
    m_test_status.test_in_progress = true;
    m_start_time                   = ZB_TIMER_GET();

    m_state = TEST_IN_PROGRESS_WAITING_FOR_TX_BUFFER;
    zigbee_benchmark_send_ping_req(NULL);

    if (mp_callback)
    {
        m_benchmark_evt.evt           = BENCHMARK_TEST_STARTED;
        m_benchmark_evt.context.error = RET_OK;
        mp_callback(&m_benchmark_evt);
    }

    NRF_LOG_INFO("Start benchmark on the local peer.");
}

/**@brief Function that stops benchmark test in master mode. */
static void zigbee_benchmark_test_stop_master(void)
{
    if (m_state != TEST_IDLE)
    {
        NRF_LOG_ERROR("Requested to get remote results, but the device is in an incorrect state.");
        return;
    }

    m_local_result.cpu_utilization = cpu_utilization_get();
    m_benchmark_evt.evt            = BENCHMARK_TEST_STOPPED;
    m_benchmark_evt.context.error  = benchmark_peer_results_request_send();

    if (mp_callback)
    {
        mp_callback(&m_benchmark_evt);
    }
}

/**@brief Function that starts benchmark test in slave mode. */
zb_zcl_status_t zigbee_benchmark_test_start_slave(void)
{
    if (m_state != TEST_IDLE)
    {
        NRF_LOG_ERROR("Stop current test in order to start different suite.");
        return ZB_ZCL_STATUS_FAIL;
    }

    m_state = TEST_IN_PROGRESS_WAITING_FOR_STOP_CMD;

    memset(&m_benchmark_evt, 0, sizeof(benchmark_evt_t));
    m_test_status.acks_lost = 0;
    m_start_time            = ZB_TIMER_GET();

    result_clear();
    UNUSED_RETURN_VALUE(cpu_utilization_start());
    m_test_status.test_in_progress = true;
    m_test_status.reset_counters   = true;

    // Generate start event. That way CLI will be suppressed for the whole remote benchmark test.
    if (mp_callback)
    {
        m_benchmark_evt.evt           = BENCHMARK_TEST_STARTED;
        m_benchmark_evt.context.error = RET_OK;
        mp_callback(&m_benchmark_evt);
    }

    NRF_LOG_INFO("Start benchmark on the remote peer.");
    return ZB_ZCL_STATUS_SUCCESS;
}

/**@brief Function that stops benchmark test in slave mode. */
zb_zcl_status_t zigbee_benchmark_test_stop_slave(void)
{
    // Check if any slave-test have been started.
    if (m_state != TEST_IN_PROGRESS_WAITING_FOR_STOP_CMD)
    {
        return ZB_ZCL_STATUS_FAIL;
    }

    mac_counters_calculate();
    m_local_result.cpu_utilization = cpu_utilization_get();
    UNUSED_RETURN_VALUE(cpu_utilization_stop());
    benchmark_test_duration_calculate();
    m_state = TEST_IDLE;
    m_test_status.test_in_progress = false;

    // Generate event in order to unlock CLI suppression on the slave board.
    if (mp_callback)
    {
        m_benchmark_evt.evt                             = BENCHMARK_TEST_COMPLETED;
        m_benchmark_evt.context.results.p_remote_result = NULL;
        m_benchmark_evt.context.results.p_local_result  = &m_local_result;
        m_benchmark_evt.context.results.p_local_status  = &m_test_status;
        mp_callback(&m_benchmark_evt);
    }

    NRF_LOG_INFO("Benchmark finished on the remote peer.");
    return ZB_ZCL_STATUS_SUCCESS;
}

/**@brief Function that is called upon reception of remote test results. */
void zigbee_benchmark_results_received(benchmark_result_t * p_result)
{
    NRF_LOG_DEBUG("Benchmark results received from the remote peer.");
    memcpy(&m_remote_result, p_result, sizeof(benchmark_result_t));

    m_benchmark_evt.evt                             = BENCHMARK_TEST_COMPLETED;
    m_benchmark_evt.context.results.p_remote_result = &m_remote_result;
    m_benchmark_evt.context.results.p_local_result  = &m_local_result;
    m_benchmark_evt.context.results.p_local_status  = &m_test_status;

    if (mp_callback)
    {
        mp_callback(&m_benchmark_evt);
    }
}

/**@brief Function that is called upon reception of benchmark control command response. */
void zigbee_benchmark_command_response_handler(zigbee_benchmark_ctrl_t cmd_id, zb_zcl_status_t status)
{
    if (status != ZB_ZCL_STATUS_SUCCESS)
    {
        m_benchmark_evt.context.error = status;

        switch (cmd_id)
        {
            case TEST_START_REQUEST:
                NRF_LOG_INFO("Remote peer failed to start benchmark execution. Error: %d", status);
                m_benchmark_evt.evt = BENCHMARK_TEST_STARTED;
                break;

            case TEST_STOP_REQUEST:
                NRF_LOG_INFO("Remote peer failed to stop benchmark execution. Error: %d", status);
                m_benchmark_evt.evt = BENCHMARK_TEST_STOPPED;
                break;

            case TEST_RESULTS_REQUEST:
                NRF_LOG_INFO("Remote peer failed to send benchmark results. Error: %d", status);
                m_benchmark_evt.evt = BENCHMARK_TEST_COMPLETED;
                break;

            default:
                NRF_LOG_WARNING("Unsupported remote benchmark command response received. Command: %d", cmd_id);
                m_benchmark_evt.context.error = ZB_ZCL_STATUS_SUCCESS;
                break;
        }

        if ((mp_callback) && (m_benchmark_evt.context.error != ZB_ZCL_STATUS_SUCCESS))
        {
            mp_callback(&m_benchmark_evt);
        }

        zigbee_benchmark_test_abort();
        return;
    }

    switch (cmd_id)
    {
        case TEST_START_REQUEST:
            NRF_LOG_DEBUG("Remote peer successfully started benchmark execution.");
            zigbee_benchmark_test_start_master();
            break;

        case TEST_STOP_REQUEST:
            NRF_LOG_DEBUG("Remote peer successfully finished benchmark execution.");
            zigbee_benchmark_test_stop_master();
            break;

        default:
            NRF_LOG_WARNING("Unsupported remote benchmark command response received: %d", cmd_id);
            break;
    }
}

