lab11/nrf52x-base/sdk/nrf5_sdk_16.0.0_thread/components/benchmark/zigbee/zigbee_benchmark.c
/**@brief Aborts current benchmark test execution. */
void zigbee_benchmark_test_abort(void)
{
    NRF_LOG_WARNING("Abort benchmark execution.");
    UNUSED_RETURN_VALUE(benchmark_test_stop());
}

void benchmark_init(void)
{
    mp_test_configuration = NULL;
    zb_ping_set_ping_indication_cb(benchmark_ping_evt_handler);

    uint32_t err_code = app_timer_create(&m_discovery_timer, APP_TIMER_MODE_SINGLE_SHOT, discovery_timeout);
    APP_ERROR_CHECK(err_code);
}

uint32_t benchmark_test_init(benchmark_configuration_t * p_configuration, benchmark_callback_t callback)
{
    if (m_state != TEST_IDLE)
    {
        NRF_LOG_ERROR("Stop current test in order to modify test settings.");
        return (uint32_t)RET_ERROR;
    }

    if ((p_configuration == NULL) || (callback == NULL))
    {
        NRF_LOG_ERROR("Both configuration and callback have to be passed.");
        return (uint32_t)RET_ERROR;
    }

    if (callback == NULL)
    {
        NRF_LOG_ERROR("Event callback have to be passed.");
        return (uint32_t)RET_ERROR;
    }

    mp_callback                      = callback;
    mp_test_configuration            = p_configuration;
    m_test_status.packets_left_count = p_configuration->count;
    m_test_status.waiting_for_ack    = 0;
    m_test_status.frame_number       = 0;

    return (uint32_t)RET_OK;
}

uint32_t benchmark_test_start(void)
{
    zb_uint16_t peer_addr;

    if (m_state != TEST_IDLE)
    {
        NRF_LOG_ERROR("Stop current test in order to start different suite.");
        return (uint32_t)RET_ERROR;
    }

    if (mp_test_configuration == NULL)
    {
        NRF_LOG_ERROR("Provide test configuration before starting a test suite.");
        return (uint32_t)RET_ERROR;
    }

    memset(&m_benchmark_evt, 0, sizeof(benchmark_evt_t));
    m_test_status.acks_lost      = 0;
    m_test_status.reset_counters = false;

    NRF_LOG_INFO("Send start request to the remote peer.");
    peer_addr = m_peer_information.peer_table[m_peer_information.selected_peer].p_address->nwk_addr;
    return (uint32_t)zb_buf_get_out_delayed_ext(zigbee_benchmark_peer_start_request_send, peer_addr, 0);
}

uint32_t benchmark_test_stop(void)
{
    // Check if this was called on slave node.
    if (m_state == TEST_IN_PROGRESS_WAITING_FOR_STOP_CMD)
    {
        return (uint32_t)zigbee_benchmark_test_stop_slave();
    }

    if (mp_test_configuration == NULL)
    {
        return (uint32_t)RET_ERROR;
    }

    if (m_state == TEST_IDLE)
    {
        NRF_LOG_ERROR("There is no ongoing test.");
        return (uint32_t)RET_ERROR;
    }

    NRF_LOG_INFO("Reset benchmark state.");
    m_state = TEST_IDLE;
    benchmark_test_duration_calculate();
    mac_counters_calculate();
    UNUSED_RETURN_VALUE(cpu_utilization_stop());

    if (m_test_status.test_in_progress)
    {
        zb_uint16_t peer_addr = m_peer_information.peer_table[m_peer_information.selected_peer].p_address->nwk_addr;

        NRF_LOG_INFO("Stop remote peer.");
        m_test_status.test_in_progress = false;

        return (uint32_t)zb_buf_get_out_delayed_ext(zigbee_benchmark_peer_stop_request_send, peer_addr, 0);
    }

    return (uint32_t) RET_OK;
}

uint32_t benchmark_peer_discover(void)
{
    if (m_state != TEST_IDLE)
    {
        NRF_LOG_ERROR("Stop current test in order to start peer discovery.");
        return (uint32_t)RET_ERROR;
    }

    if (mp_test_configuration == NULL)
    {
        NRF_LOG_ERROR("Provide test configuration before starting a peer discovery.");
        return (uint32_t)RET_ERROR;
    }

    memset(&m_peer_information, 0, sizeof(m_peer_information));

    zb_ret_t error = zigbee_benchmark_peer_discovery_request_send();
    if (error != RET_OK)
    {
        return (uint32_t)error;
    }

    uint32_t err_code = app_timer_start(m_discovery_timer, APP_TIMER_TICKS(BENCHMARK_DISCOVERY_TIMEOUT), NULL);
    APP_ERROR_CHECK(err_code);

    return (uint32_t)RET_OK;
}

const benchmark_peer_db_t * benchmark_peer_table_get(void)
{
    return &m_peer_information;
}

benchmark_status_t * benchmark_status_get(void)
{
    return &m_test_status;
}

void benchmark_process(void)
{
    switch (m_state)
    {
        // fall through
        case TEST_IN_PROGRESS_FRAME_SENT_WAITING_FOR_ACK:
        case TEST_IN_PROGRESS_FRAME_SENT_WAITING_FOR_ECHO:
        case TEST_IN_PROGRESS_FRAME_SENDING:
        case TEST_IN_PROGRESS_WAITING_FOR_STOP_CMD:
        case TEST_IDLE:
            break;

        case TEST_ERROR:
            if (mp_test_configuration)
            {
                NRF_LOG_ERROR("Error occurred during the test transmission. Sent %d packets.",
                              (mp_test_configuration->count - m_test_status.packets_left_count));
            }
            m_test_status.test_in_progress = false;
            m_state = TEST_IDLE;

            if (mp_callback)
            {
                m_benchmark_evt.evt           = BENCHMARK_TEST_STOPPED;
                m_benchmark_evt.context.error = (uint32_t)RET_ERROR;
                mp_callback(&m_benchmark_evt);
            }
            break;

        case TEST_IN_PROGRESS_WAITING_FOR_TX_BUFFER:
            // Retry sending the next buffer.
            zigbee_benchmark_send_ping_req(NULL);
            break;

        case TEST_IN_PROGRESS_FRAME_SENT:
            if (m_test_status.packets_left_count > 0)
            {
                NRF_LOG_DEBUG("Test frame sent, prepare next frame.");
                m_state = TEST_IN_PROGRESS_WAITING_FOR_TX_BUFFER;
                zigbee_benchmark_send_ping_req(NULL);
            }
            else
            {
                NRF_LOG_DEBUG("Test frame sent, test finished.");
                m_state = TEST_FINISHED;
            }
            break;

        case TEST_FINISHED:
            NRF_LOG_INFO("Benchmark test finished. Proceed with the tear down process.");
            UNUSED_RETURN_VALUE(benchmark_test_stop());
            break;

        default:
            NRF_LOG_ERROR("Invalid test state. Fall back to the idle state.");
            zigbee_benchmark_test_abort();
            break;
    }
}

uint64_t benchmark_local_device_id_get(void)
{
    eui64_map_addr_t dev_addr;

    zb_osif_get_ieee_eui64(dev_addr.arr_addr);

    return dev_addr.uint_addr;
}

uint32_t benchmark_peer_results_request_send(void)
{
    zb_uint16_t peer_addr = m_peer_information.peer_table[m_peer_information.selected_peer].p_address->nwk_addr;

    NRF_LOG_INFO("Send a request for benchmark results to the remote peer.");
    return zb_buf_get_out_delayed_ext(zigbee_benchmark_peer_results_request_send, peer_addr, 0);
}

benchmark_result_t * zigbee_benchmark_local_result_get(void)
{
    return &m_local_result;
}
